<?php 
    // транслит
    function translit($str) {
        
        $chars_search= Array("ж", "ё", "й","ю","ь","ч", "щ", "ц","у","к","е","н","г","ш", "з","х","ъ","ф","ы","в","а","п","р","о","л","д","э", "я", "с","м","и","т","б","Ё", "Й","Ю", "Ч","Ь","Щ", "Ц","У","К","Е","Н","Г","Ш", "З","Х","Ъ","Ф","Ы","В","А","П","Р","О","Л","Д","Ж", "Э", "Я", "С","М","И","Т","Б");
        $chars_replace=Array("zh","yo","i","yu","","ch","sh","c","u","k","e","n","g","sh","z","h","", "f","y","v","a","p","r","o","l","d","ye","ya","s","m","i","t","b","yo","i","yu","ch","","sh","c","u","k","e","n","g","sh","z","h","", "f","y","v","a","p","r","o","l","d","zh","ye","ja","s","m","i","t","b");
        //$chars_spec=Array( "~","`","!","@","#","№","$",";","%","^","&","?","*","(",")","=","+","-","/","*","_","<",">","\\","|",".",",",":",'"',"±","«","»","[","]");
        $str=str_replace($chars_search,$chars_replace,$str);
        $str=str_replace(" ","-",$str);
    	$str=strtolower($str);
        $str=preg_replace("/[^a-z-0-9]+/", '', $str);
        return $str;
    }
?>